{
  "backend/main.mo": "Implements access‑controlled user profiles and CRUD operations for recruitment posts with types, metadata fields, and timestamps.",
  "feature_evidence.json": "Lists feature evidence mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style reference summarizing frontend files and their roles for posts, auth, routing, and utilities.",
  "frontend/index.css": "Tailwind-based global styling defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML template loading the React app with metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, theme provider, and admin-protected pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with navigation for non-admin users.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard that checks Internet Identity and admin status before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter their name and save their profile.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, search, mobile menu, and admin link visibility.",
  "frontend/src/components/seo/Seo.tsx": "Updates document title and meta description when props change.",
  "frontend/src/features/posts/components/KeyValueEditor.tsx": "Provides a UI to add, edit, and remove key-value pairs for post fields.",
  "frontend/src/features/posts/components/ListFilterBar.tsx": "Renders filters for sorting, organization, tags, and year with a clear button.",
  "frontend/src/features/posts/components/PostCard.tsx": "Displays a summarized card view of a recruitment post with tags and metadata.",
  "frontend/src/features/posts/components/PostEditorForm.tsx": "Form for creating or editing posts, including basic info, detailed fields, and tag management.",
  "frontend/src/features/posts/hooks/useListingQueryParams.ts": "Manages listing query params and navigation updates with cleaned search values.",
  "frontend/src/features/posts/pages/AdminDashboardPage.tsx": "Shows admin post management table with actions to publish, unpublish, delete, and create posts.",
  "frontend/src/features/posts/pages/AdminPostEditPage.tsx": "Admin page for editing an existing post with update, publish/unpublish, and delete actions.",
  "frontend/src/features/posts/pages/AdminPostNewPage.tsx": "Admin page for creating a new post and redirecting to its edit page after creation.",
  "frontend/src/features/posts/pages/CategoryPage.tsx": "Displays posts of a specific category with sorting, filtering, and dynamic listings.",
  "frontend/src/features/posts/pages/HomePage.tsx": "Shows the latest published posts on the homepage, limited to 12 and sorted by newest.",
  "frontend/src/features/posts/pages/PostDetailPage.tsx": "Renders full details for a single post including metadata, sections, and SEO.",
  "frontend/src/features/posts/pages/SearchPage.tsx": "Provides search across published posts with filtering, sorting, and search result listing.",
  "frontend/src/features/posts/utils/formatters.ts": "Contains helpers for formatting post types and timestamps into readable strings.",
  "frontend/src/features/posts/utils/listingTransforms.ts": "Utility functions for sorting, filtering, generating facets, and searching posts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin checks, and recruitment posts via the backend actor.",
  "frontend/src/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layouts, and animations using custom CSS variables and plugins.",
  "project_state.json": "Describes the project's purpose, required features, images, and current development state."
}